IdeaRS.OpenModel.Connection.ConnectionPoint
ConnectedDesignMemeber

IdeaRS.OpenModel.Connection.ConnectionPoint.#ctor
Constructor

IdeaRS.OpenModel.Connection.ConnectionPoint.Name
Name of Element

IdeaRS.OpenModel.Connection.ConnectionPoint.NodeId
Id of node
Remarks:
This property is not longer supported. Use the IdeaRS.OpenModel.Connection.ConnectionPoint.Node property instead of this one.

IdeaRS.OpenModel.Connection.ConnectionPoint.Node
Node

IdeaRS.OpenModel.Connection.ConnectionPoint.ConnectedMembers
Connected members as collection of IDs.

IdeaRS.OpenModel.Connection.ConnectionPoint.NodeIdSerialize
Gets or sets the Id of node for Xml serialization (back compatibility).